---
kind: other
id: Methods.T:Autodesk.Revit.DB.DetailCurve
source: html/a8730d26-9d38-c54c-5080-577e48c7b291.htm
---
# DetailCurve Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.